<font size='5'><b>Selecting Data in SQL</b><font>

In [1]:
import pandas as pd
import numpy as np
import sqlite3
conn = sqlite3.connect('planets.db')
cur = conn.cursor()

<b>Select just the name and color of each planet</b>

In [2]:
cur.execute("""SELECT name, color FROM planets;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

      name   color
0  Mercury    gray
1    Venus  yellow
2    Earth    blue
3     Mars     red
4  Jupiter  orange

In [3]:
df.shape

(8, 2)

<b>Select all columns for each planet whose mass is greater than 1.00</b>

In [4]:
cur.execute("""SELECT * FROM planets
               WHERE (mass > 1.00)
               ORDER BY mass DESC;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

   id     name       color  num_of_moons    mass  rings
0   5  Jupiter      orange            68  317.90      0
1   6   Saturn       hazel            62   95.19      1
2   8  Neptune   dark blue            14   17.15      1
3   7   Uranus  light blue            27   14.54      1

In [5]:
df.mass.value_counts()

317.90    1
17.15     1
14.54     1
95.19     1
Name: mass, dtype: int64

In [6]:
df.shape

(4, 6)

<b>Select the name and mass of each planet whose mass is less than or equal to 1.00</b>

In [7]:
cur.execute("""SELECT name, mass FROM planets
               WHERE (mass <= 1.00)
               ORDER BY mass ASC;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

      name  mass
0     Mars  0.11
1  Mercury  0.55
2    Venus  0.82
3    Earth  1.00

<b>Select the name and color of each planet that has more than 10 moons</b>

In [8]:
cur.execute("""SELECT name, color FROM planets
               WHERE (num_of_moons > 10);""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

      name       color
0  Jupiter      orange
1   Saturn       hazel
2   Uranus  light blue
3  Neptune   dark blue

<b>Select the planet that has at least one moon and a mass less than 1.00</b>

In [9]:
cur.execute("""SELECT * from planets
               WHERE (num_of_moons >=1) AND (mass < 1.00);""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

   id  name color  num_of_moons  mass  rings
0   4  Mars   red             2  0.11      0

<b>Select the name and color of planets that have a color of blue, light blue, or dark blue</b>

In [10]:
cur.execute("""SELECT name, color 
               FROM planets
               WHERE color == 'blue' 
               OR color == 'light blue' 
               OR color == 'dark blue';
               """)
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

      name       color
0    Earth        blue
1   Uranus  light blue
2  Neptune   dark blue

<b>Select the name, color, and number of moons for the 4 largest planets that don't have rings and order them from largest to smallest</b>

In [12]:
cur.execute("""SELECT name, color, num_of_moons
               FROM planets
               WHERE rings == 0
               ORDER BY mass DESC
               LIMIT 4;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

      name   color  num_of_moons
0  Jupiter  orange            68
1    Earth    blue             1
2    Venus  yellow             0
3  Mercury    gray             0